bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x8.svd
            <register>
               <name>MACA1HR</name>
               <displayName>MACA1HR</displayName>
               <description>Ethernet MAC address 1 high           register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>MACA1H</name>
                     <description>MACA1H</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MBC</name>
                     <description>MBC</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SA</name>
                     <description>SA</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AE</name>
                     <description>AE</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MACA1LR</name>
               <displayName>MACA1LR</displayName>
               <description>Ethernet MAC address1 low           register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>MACA1LR</name>
                     <description>MACA1LR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MACA2HR</name>
               <displayName>MACA2HR</displayName>
               <description>Ethernet MAC address 2 high           register</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>MAC2AH</name>
                     <description>MAC2AH</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MBC</name>
                     <description>MBC</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SA</name>
                     <description>SA</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AE</name>
                     <description>AE</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MACA2LR</name>
               <displayName>MACA2LR</displayName>
               <description>Ethernet MAC address 2 low           register</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>MACA2L</name>
                     <description>MACA2L</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>31</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MACA3HR</name>
               <displayName>MACA3HR</displayName>
               <description>Ethernet MAC address 3 high           register</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000FFFF</resetValue>
               <fields>
                  <field>
                     <name>MACA3H</name>
                     <description>MACA3H</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MBC</name>
                     <description>MBC</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SA</name>
                     <description>SA</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AE</name>
                     <description>AE</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MACA3LR</name>
               <displayName>MACA3LR</displayName>
               <description>Ethernet MAC address 3 low           register</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>MBCA3L</name>
                     <description>MBCA3L</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MACRWUFFER</name>
               <displayName>MACRWUFFER</displayName>
               <description>Ethernet MAC remote wakeup frame filter           register</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
            </register>
