bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x8.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>LTCD</name>
         <description>LCD-TFT Controller</description>
         <groupName>LTDC</groupName>
         <baseAddress>0x40016800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>LCD_TFT</name>
            <description>LTDC global interrupt</description>
            <value>88</value>
         </interrupt>
         <interrupt>
            <name>LCD_TFT</name>
            <description>LCD-TFT global Error interrupt</description>
            <value>89</value>
         </interrupt>
         <registers>
            <register>
               <name>SSCR</name>
               <displayName>SSCR</displayName>
               <description>Synchronization Size Configuration           Register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HSW</name>
                     <description>Horizontal Synchronization Width (in               units of pixel clock period)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>VSH</name>
                     <description>Vertical Synchronization Height (in               units of horizontal scan line)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BPCR</name>
               <displayName>BPCR</displayName>
               <description>Back Porch Configuration           Register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AHBP</name>
                     <description>Accumulated Horizontal back porch (in               units of pixel clock period)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>AVBP</name>
                     <description>Accumulated Vertical back porch (in               units of horizontal scan line)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AWCR</name>
               <displayName>AWCR</displayName>
               <description>Active Width Configuration           Register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AAV</name>
                     <description>AAV</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>AAH</name>
                     <description>Accumulated Active Height (in units of               horizontal scan line)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TWCR</name>
               <displayName>TWCR</displayName>
               <description>Total Width Configuration           Register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TOTALW</name>
                     <description>Total Width (in units of pixel clock               period)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>TOTALH</name>
                     <description>Total Height (in units of horizontal               scan line)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GCR</name>
               <displayName>GCR</displayName>
               <description>Global Control Register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <resetValue>0x00002220</resetValue>
               <fields>
                  <field>
                     <name>HSPOL</name>
                     <description>Horizontal Synchronization               Polarity</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VSPOL</name>
                     <description>Vertical Synchronization               Polarity</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DEPOL</name>
                     <description>Data Enable Polarity</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PCPOL</name>
                     <description>Pixel Clock Polarity</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DEN</name>
                     <description>Dither Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DRW</name>
                     <description>Dither Red Width</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DGW</name>
                     <description>Dither Green Width</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Dither Blue Width</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LTDCEN</name>
                     <description>LCD-TFT controller enable               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRCR</name>
               <displayName>SRCR</displayName>
               <description>Shadow Reload Configuration           Register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VBR</name>
                     <description>Vertical Blanking Reload</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IMR</name>
                     <description>Immediate Reload</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BCCR</name>
               <displayName>BCCR</displayName>
               <description>Background Color Configuration           Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BC</name>
                     <description>Background Color Red value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <displayName>IER</displayName>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RRIE</name>
                     <description>Register Reload interrupt               enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TERRIE</name>
                     <description>Transfer Error Interrupt               Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FUIE</name>
                     <description>FIFO Underrun Interrupt               Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LIE</name>
                     <description>Line Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <displayName>ISR</displayName>
               <description>Interrupt Status Register</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RRIF</name>
                     <description>Register Reload Interrupt               Flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TERRIF</name>
                     <description>Transfer Error interrupt               flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FUIF</name>
                     <description>FIFO Underrun Interrupt               flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LIF</name>
                     <description>Line Interrupt flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICR</name>
               <displayName>ICR</displayName>
               <description>Interrupt Clear Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRRIF</name>
                     <description>Clears Register Reload Interrupt               Flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTERRIF</name>
                     <description>Clears the Transfer Error Interrupt               Flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFUIF</name>
                     <description>Clears the FIFO Underrun Interrupt               flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLIF</name>
                     <description>Clears the Line Interrupt               Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LIPCR</name>
               <displayName>LIPCR</displayName>
               <description>Line Interrupt Position Configuration           Register</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LIPOS</name>
                     <description>Line Interrupt Position</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPSR</name>
               <displayName>CPSR</displayName>
               <description>Current Position Status           Register</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CXPOS</name>
                     <description>Current X Position</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>CYPOS</name>
                     <description>Current Y Position</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CDSR</name>
               <displayName>CDSR</displayName>
               <description>Current Display Status           Register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x0000000F</resetValue>
               <fields>
                  <field>
                     <name>HSYNCS</name>
                     <description>Horizontal Synchronization display               Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VSYNCS</name>
                     <description>Vertical Synchronization display               Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HDES</name>
                     <description>Horizontal Data Enable display               Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDES</name>
                     <description>Vertical Data Enable display               Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>L1CR</name>
               <displayName>L1CR</displayName>
               <description>Layerx Control Register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLUTEN</name>
                     <description>Color Look-Up Table Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COLKEN</name>
                     <description>Color Keying Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LEN</name>
                     <description>Layer Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>L1WHPCR</name>
               <displayName>L1WHPCR</displayName>
               <description>Layerx Window Horizontal Position           Configuration Register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WHSPPOS</name>
                     <description>Window Horizontal Stop               Position</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>WHSTPOS</name>
                     <description>Window Horizontal Start               Position</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>L1WVPCR</name>
               <displayName>L1WVPCR</displayName>
               <description>Layerx Window Vertical Position           Configuration Register</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WVSPPOS</name>
                     <description>Window Vertical Stop               Position</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>WVSTPOS</name>
                     <description>Window Vertical Start               Position</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>L1CKCR</name>
               <displayName>L1CKCR</displayName>
               <description>Layerx Color Keying Configuration           Register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CKRED</name>
                     <description>Color Key Red value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CKGREEN</name>
                     <description>Color Key Green value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CKBLUE</name>
                     <description>Color Key Blue value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>L1PFCR</name>
               <displayName>L1PFCR</displayName>
               <description>Layerx Pixel Format Configuration           Register</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PF</name>
                     <description>Pixel Format</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>L1CACR</name>
               <displayName>L1CACR</displayName>
               <description>Layerx Constant Alpha Configuration           Register</description>
               <addressOffset>0x98</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CONSTA</name>
                     <description>Constant Alpha</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
