bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x8.svd
            <register>
               <name>HUFFBASE21</name>
               <displayName>HUFFBASE21</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1E4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE22</name>
               <displayName>HUFFBASE22</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1E8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE23</name>
               <displayName>HUFFBASE23</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1EC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE24</name>
               <displayName>HUFFBASE24</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1F0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE25</name>
               <displayName>HUFFBASE25</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1F4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE26</name>
               <displayName>HUFFBASE26</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1F8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE27</name>
               <displayName>HUFFBASE27</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x1FC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE28</name>
               <displayName>HUFFBASE28</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x200</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE29</name>
               <displayName>HUFFBASE29</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x204</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE30</name>
               <displayName>HUFFBASE30</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x208</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFBASE31</name>
               <displayName>HUFFBASE31</displayName>
               <description>JPEG HuffSymb tables</description>
               <addressOffset>0x20C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffBase_RAM_0</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>HuffBase_RAM_1</name>
                     <description>HuffBase RAM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB0</name>
               <displayName>HUFFSYMB0</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x210</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB1</name>
               <displayName>HUFFSYMB1</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x214</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB2</name>
               <displayName>HUFFSYMB2</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x218</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB3</name>
               <displayName>HUFFSYMB3</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x21C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB4</name>
               <displayName>HUFFSYMB4</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x220</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB5</name>
               <displayName>HUFFSYMB5</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x224</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB6</name>
               <displayName>HUFFSYMB6</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x228</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB7</name>
               <displayName>HUFFSYMB7</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x22C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB8</name>
               <displayName>HUFFSYMB8</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x230</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB9</name>
               <displayName>HUFFSYMB9</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x234</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB10</name>
               <displayName>HUFFSYMB10</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x238</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB11</name>
               <displayName>HUFFSYMB11</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x23C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB12</name>
               <displayName>HUFFSYMB12</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x240</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB13</name>
               <displayName>HUFFSYMB13</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x244</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB14</name>
               <displayName>HUFFSYMB14</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x248</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB15</name>
               <displayName>HUFFSYMB15</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x24C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB16</name>
               <displayName>HUFFSYMB16</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x250</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB17</name>
               <displayName>HUFFSYMB17</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x254</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB18</name>
               <displayName>HUFFSYMB18</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x258</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFSYMB19</name>
               <displayName>HUFFSYMB19</displayName>
               <description>JPEG HUFFSYMB tables</description>
               <addressOffset>0x25C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HuffSymb_RAM</name>
                     <description>DHTSymb RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
