bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x8.svd
            <register>
               <name>HUFFENC_AC0_74</name>
               <displayName>HUFFENC_AC0_74</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x628</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_75</name>
               <displayName>HUFFENC_AC0_75</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x62C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_76</name>
               <displayName>HUFFENC_AC0_76</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x630</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_77</name>
               <displayName>HUFFENC_AC0_77</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x634</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_78</name>
               <displayName>HUFFENC_AC0_78</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x638</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_79</name>
               <displayName>HUFFENC_AC0_79</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x63C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_80</name>
               <displayName>HUFFENC_AC0_80</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x640</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_81</name>
               <displayName>HUFFENC_AC0_81</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x644</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_82</name>
               <displayName>HUFFENC_AC0_82</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x648</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_83</name>
               <displayName>HUFFENC_AC0_83</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x64C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_84</name>
               <displayName>HUFFENC_AC0_84</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x650</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_85</name>
               <displayName>HUFFENC_AC0_85</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x654</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_86</name>
               <displayName>HUFFENC_AC0_86</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x658</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_87</name>
               <displayName>HUFFENC_AC0_87</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x65C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_0</name>
               <displayName>HUFFENC_AC1_0</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x660</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_1</name>
               <displayName>HUFFENC_AC1_1</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x664</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_2</name>
               <displayName>HUFFENC_AC1_2</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x668</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_3</name>
               <displayName>HUFFENC_AC1_3</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x66C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_4</name>
               <displayName>HUFFENC_AC1_4</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x670</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_5</name>
               <displayName>HUFFENC_AC1_5</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x674</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_6</name>
               <displayName>HUFFENC_AC1_6</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x678</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_7</name>
               <displayName>HUFFENC_AC1_7</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x67C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_8</name>
               <displayName>HUFFENC_AC1_8</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x680</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_9</name>
               <displayName>HUFFENC_AC1_9</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x684</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_10</name>
               <displayName>HUFFENC_AC1_10</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x688</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_11</name>
               <displayName>HUFFENC_AC1_11</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x68C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_12</name>
               <displayName>HUFFENC_AC1_12</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x690</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_13</name>
               <displayName>HUFFENC_AC1_13</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x694</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_14</name>
               <displayName>HUFFENC_AC1_14</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x698</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_15</name>
               <displayName>HUFFENC_AC1_15</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x69C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_16</name>
               <displayName>HUFFENC_AC1_16</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x6A0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_17</name>
               <displayName>HUFFENC_AC1_17</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x6A4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_18</name>
               <displayName>HUFFENC_AC1_18</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x6A8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
