bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x8.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>Ethernet_MMC</name>
         <description>Ethernet: MAC management counters</description>
         <groupName>Ethernet</groupName>
         <baseAddress>0x40028100</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MMCCR</name>
               <displayName>MMCCR</displayName>
               <description>Ethernet MMC control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CR</name>
                     <description>CR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSR</name>
                     <description>CSR</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ROR</name>
                     <description>ROR</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCF</name>
                     <description>MCF</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCP</name>
                     <description>MCP</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MCFHP</name>
                     <description>MCFHP</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMCRIR</name>
               <displayName>MMCRIR</displayName>
               <description>Ethernet MMC receive interrupt           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RFCES</name>
                     <description>RFCES</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFAES</name>
                     <description>RFAES</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RGUFS</name>
                     <description>RGUFS</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMCTIR</name>
               <displayName>MMCTIR</displayName>
               <description>Ethernet MMC transmit interrupt           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TGFSCS</name>
                     <description>TGFSCS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TGFMSCS</name>
                     <description>TGFMSCS</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TGFS</name>
                     <description>TGFS</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMCRIMR</name>
               <displayName>MMCRIMR</displayName>
               <description>Ethernet MMC receive interrupt mask           register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RFCEM</name>
                     <description>RFCEM</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFAEM</name>
                     <description>RFAEM</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RGUFM</name>
                     <description>RGUFM</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMCTIMR</name>
               <displayName>MMCTIMR</displayName>
               <description>Ethernet MMC transmit interrupt mask           register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TGFSCM</name>
                     <description>TGFSCM</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TGFMSCM</name>
                     <description>TGFMSCM</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TGFM</name>
                     <description>TGFM</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMCTGFSCCR</name>
               <displayName>MMCTGFSCCR</displayName>
               <description>Ethernet MMC transmitted good frames after a           single collision counter</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TGFSCC</name>
                     <description>TGFSCC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMCTGFMSCCR</name>
               <displayName>MMCTGFMSCCR</displayName>
               <description>Ethernet MMC transmitted good frames after           more than a single collision</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TGFMSCC</name>
                     <description>TGFMSCC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMCTGFCR</name>
               <displayName>MMCTGFCR</displayName>
               <description>Ethernet MMC transmitted good frames counter           register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TGFC</name>
                     <description>HTL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMCRFCECR</name>
               <displayName>MMCRFCECR</displayName>
               <description>Ethernet MMC received frames with CRC error           counter register</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RFCFC</name>
                     <description>RFCFC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMCRFAECR</name>
               <displayName>MMCRFAECR</displayName>
               <description>Ethernet MMC received frames with alignment           error counter register</description>
               <addressOffset>0x98</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RFAEC</name>
                     <description>RFAEC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMCRGUFCR</name>
               <displayName>MMCRGUFCR</displayName>
               <description>MMC received good unicast frames counter           register</description>
               <addressOffset>0xC4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RGUFC</name>
                     <description>RGUFC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
