bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x8.svd
            <register>
               <name>OTG_HS_HCDMA4</name>
               <displayName>OTG_HS_HCDMA4</displayName>
               <description>OTG_HS host channel-4 DMA address           register</description>
               <addressOffset>0x194</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCDMA5</name>
               <displayName>OTG_HS_HCDMA5</displayName>
               <description>OTG_HS host channel-5 DMA address           register</description>
               <addressOffset>0x1B4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCDMA6</name>
               <displayName>OTG_HS_HCDMA6</displayName>
               <description>OTG_HS host channel-6 DMA address           register</description>
               <addressOffset>0x1D4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCDMA7</name>
               <displayName>OTG_HS_HCDMA7</displayName>
               <description>OTG_HS host channel-7 DMA address           register</description>
               <addressOffset>0x1F4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCDMA8</name>
               <displayName>OTG_HS_HCDMA8</displayName>
               <description>OTG_HS host channel-8 DMA address           register</description>
               <addressOffset>0x214</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCDMA9</name>
               <displayName>OTG_HS_HCDMA9</displayName>
               <description>OTG_HS host channel-9 DMA address           register</description>
               <addressOffset>0x234</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCDMA10</name>
               <displayName>OTG_HS_HCDMA10</displayName>
               <description>OTG_HS host channel-10 DMA address           register</description>
               <addressOffset>0x254</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCDMA11</name>
               <displayName>OTG_HS_HCDMA11</displayName>
               <description>OTG_HS host channel-11 DMA address           register</description>
               <addressOffset>0x274</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCCHAR12</name>
               <displayName>OTG_HS_HCCHAR12</displayName>
               <description>OTG_HS host channel-12 characteristics           register</description>
               <addressOffset>0x278</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>EPNUM</name>
                     <description>Endpoint number</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EPDIR</name>
                     <description>Endpoint direction</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSDEV</name>
                     <description>Low-speed device</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MC</name>
                     <description>Multi Count (MC) / Error Count               (EC)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DAD</name>
                     <description>Device address</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>ODDFRM</name>
                     <description>Odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHDIS</name>
                     <description>Channel disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHENA</name>
                     <description>Channel enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT12</name>
               <displayName>OTG_HS_HCSPLT12</displayName>
               <description>OTG_HS host channel-12 split control           register</description>
               <addressOffset>0x27C</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCINT12</name>
               <displayName>OTG_HS_HCINT12</displayName>
               <description>OTG_HS host channel-12 interrupt           register</description>
               <addressOffset>0x280</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRC</name>
                     <description>Transfer completed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHH</name>
                     <description>Channel halted</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHBERR</name>
                     <description>AHB error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALL</name>
                     <description>STALL response received               interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAK</name>
                     <description>NAK response received               interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACK</name>
                     <description>ACK response received/transmitted               interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>Response received               interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXERR</name>
                     <description>Transaction error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBERR</name>
                     <description>Babble error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRMOR</name>
                     <description>Frame overrun</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTERR</name>
                     <description>Data toggle error</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCINTMSK12</name>
               <displayName>OTG_HS_HCINTMSK12</displayName>
               <description>OTG_HS host channel-12 interrupt mask           register</description>
               <addressOffset>0x284</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRCM</name>
                     <description>Transfer completed mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHHM</name>
                     <description>Channel halted mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AHBERR</name>
                     <description>AHB error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLM</name>
                     <description>STALL response received interrupt               mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKM</name>
                     <description>NAK response received interrupt               mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACKM</name>
                     <description>ACK response received/transmitted               interrupt mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NYET</name>
                     <description>Response received               interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXERRM</name>
                     <description>Transaction error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBERRM</name>
                     <description>Babble error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRMORM</name>
                     <description>Frame overrun mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTERRM</name>
                     <description>Data toggle error mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCTSIZ12</name>
               <displayName>OTG_HS_HCTSIZ12</displayName>
               <description>OTG_HS host channel-12 transfer size           register</description>
               <addressOffset>0x288</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCDMA12</name>
               <displayName>OTG_HS_HCDMA12</displayName>
               <description>OTG_HS host channel-12 DMA address           register</description>
               <addressOffset>0x28C</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCCHAR13</name>
               <displayName>OTG_HS_HCCHAR13</displayName>
               <description>OTG_HS host channel-13 characteristics           register</description>
               <addressOffset>0x290</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>EPNUM</name>
                     <description>Endpoint number</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EPDIR</name>
                     <description>Endpoint direction</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSDEV</name>
                     <description>Low-speed device</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MC</name>
                     <description>Multi Count (MC) / Error Count               (EC)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DAD</name>
                     <description>Device address</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>ODDFRM</name>
                     <description>Odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHDIS</name>
                     <description>Channel disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHENA</name>
                     <description>Channel enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_HCSPLT13</name>
               <displayName>OTG_HS_HCSPLT13</displayName>
               <description>OTG_HS host channel-13 split control           register</description>
               <addressOffset>0x294</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>PRTADDR</name>
                     <description>Port address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>HUBADDR</name>
                     <description>Hub address</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>XACTPOS</name>
                     <description>XACTPOS</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>COMPLSPLT</name>
                     <description>Do complete split</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPLITEN</name>
                     <description>Split enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
