bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x8.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>OTG_HS_DEVICE</name>
         <description>USB on the go high speed</description>
         <groupName>USB_OTG_HS</groupName>
         <baseAddress>0x40040800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>OTG_HS_DCFG</name>
               <displayName>OTG_HS_DCFG</displayName>
               <description>OTG_HS device configuration           register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x02200000</resetValue>
               <fields>
                  <field>
                     <name>DSPD</name>
                     <description>Device speed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>NZLSOHSK</name>
                     <description>Nonzero-length status OUT               handshake</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAD</name>
                     <description>Device address</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PFIVL</name>
                     <description>Periodic (micro)frame               interval</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PERSCHIVL</name>
                     <description>Periodic scheduling               interval</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DCTL</name>
               <displayName>OTG_HS_DCTL</displayName>
               <description>OTG_HS device control register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>RWUSIG</name>
                     <description>Remote wakeup signaling</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SDIS</name>
                     <description>Soft disconnect</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GINSTS</name>
                     <description>Global IN NAK status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>GONSTS</name>
                     <description>Global OUT NAK status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TCTL</name>
                     <description>Test control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SGINAK</name>
                     <description>Set global IN NAK</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>CGINAK</name>
                     <description>Clear global IN NAK</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SGONAK</name>
                     <description>Set global OUT NAK</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>CGONAK</name>
                     <description>Clear global OUT NAK</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>POPRGDNE</name>
                     <description>Power-on programming done</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DSTS</name>
               <displayName>OTG_HS_DSTS</displayName>
               <description>OTG_HS device status register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>SUSPSTS</name>
                     <description>Suspend status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENUMSPD</name>
                     <description>Enumerated speed</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>EERR</name>
                     <description>Erratic error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FNSOF</name>
                     <description>Frame number of the received               SOF</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPMSK</name>
               <displayName>OTG_HS_DIEPMSK</displayName>
               <description>OTG_HS device IN endpoint common interrupt           mask register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRCM</name>
                     <description>Transfer completed interrupt               mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDM</name>
                     <description>Endpoint disabled interrupt               mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOM</name>
                     <description>Timeout condition mask (nonisochronous               endpoints)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITTXFEMSK</name>
                     <description>IN token received when TxFIFO empty               mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INEPNMM</name>
                     <description>IN token received with EP mismatch               mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INEPNEM</name>
                     <description>IN endpoint NAK effective               mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFURM</name>
                     <description>FIFO underrun mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BIM</name>
                     <description>BNA interrupt mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPMSK</name>
               <displayName>OTG_HS_DOEPMSK</displayName>
               <description>OTG_HS device OUT endpoint common interrupt           mask register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRCM</name>
                     <description>Transfer completed interrupt               mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDM</name>
                     <description>Endpoint disabled interrupt               mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUPM</name>
                     <description>SETUP phase done mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDM</name>
                     <description>OUT token received when endpoint               disabled mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>B2BSTUP</name>
                     <description>Back-to-back SETUP packets received               mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPEM</name>
                     <description>OUT packet error mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOIM</name>
                     <description>BNA interrupt mask</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DAINT</name>
               <displayName>OTG_HS_DAINT</displayName>
               <description>OTG_HS device all endpoints interrupt           register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>IEPINT</name>
                     <description>IN endpoint interrupt bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>OEPINT</name>
                     <description>OUT endpoint interrupt               bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DAINTMSK</name>
               <displayName>OTG_HS_DAINTMSK</displayName>
               <description>OTG_HS all endpoints interrupt mask           register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>IEPM</name>
                     <description>IN EP interrupt mask bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>OEPM</name>
                     <description>OUT EP interrupt mask bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DVBUSDIS</name>
               <displayName>OTG_HS_DVBUSDIS</displayName>
               <description>OTG_HS device VBUS discharge time           register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x000017D7</resetValue>
               <fields>
                  <field>
                     <name>VBUSDT</name>
                     <description>Device VBUS discharge time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DVBUSPULSE</name>
               <displayName>OTG_HS_DVBUSPULSE</displayName>
               <description>OTG_HS device VBUS pulsing time           register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x000005B8</resetValue>
               <fields>
                  <field>
                     <name>DVBUSP</name>
                     <description>Device VBUS pulsing time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DTHRCTL</name>
               <displayName>OTG_HS_DTHRCTL</displayName>
               <description>OTG_HS Device threshold control           register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>NONISOTHREN</name>
                     <description>Nonisochronous IN endpoints threshold               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISOTHREN</name>
                     <description>ISO IN endpoint threshold               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXTHRLEN</name>
                     <description>Transmit threshold length</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>RXTHREN</name>
                     <description>Receive threshold enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXTHRLEN</name>
                     <description>Receive threshold length</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>ARPEN</name>
                     <description>Arbiter parking enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPEMPMSK</name>
               <displayName>OTG_HS_DIEPEMPMSK</displayName>
               <description>OTG_HS device IN endpoint FIFO empty           interrupt mask register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>INEPTXFEM</name>
                     <description>IN EP Tx FIFO empty interrupt mask               bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DEACHINT</name>
               <displayName>OTG_HS_DEACHINT</displayName>
               <description>OTG_HS device each endpoint interrupt           register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>IEP1INT</name>
                     <description>IN endpoint 1interrupt bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OEP1INT</name>
                     <description>OUT endpoint 1 interrupt               bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DEACHINTMSK</name>
               <displayName>OTG_HS_DEACHINTMSK</displayName>
               <description>OTG_HS device each endpoint interrupt           register mask</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>IEP1INTM</name>
                     <description>IN Endpoint 1 interrupt mask               bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OEP1INTM</name>
                     <description>OUT Endpoint 1 interrupt mask               bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
