bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x8.svd
            <register>
               <name>OTG_HS_DOEPCTL6</name>
               <displayName>OTG_HS_DOEPCTL6</displayName>
               <description>OTG device endpoint-6 control           register</description>
               <addressOffset>0x3C0</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBAEP</name>
                     <description>USB active endpoint</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EONUM_DPID</name>
                     <description>Even odd frame/Endpoint data               PID</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NAKSTS</name>
                     <description>NAK status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNPM</name>
                     <description>Snoop mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>Stall</name>
                     <description>STALL handshake</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNAK</name>
                     <description>Clear NAK</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SNAK</name>
                     <description>Set NAK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SD0PID_SEVNFRM</name>
                     <description>Set DATA0 PID/Set even               frame</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SODDFRM</name>
                     <description>Set odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EPDIS</name>
                     <description>Endpoint disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPENA</name>
                     <description>Endpoint enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPCTL7</name>
               <displayName>OTG_HS_DOEPCTL7</displayName>
               <description>OTG device endpoint-7 control           register</description>
               <addressOffset>0x3E0</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBAEP</name>
                     <description>USB active endpoint</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EONUM_DPID</name>
                     <description>Even odd frame/Endpoint data               PID</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NAKSTS</name>
                     <description>NAK status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNPM</name>
                     <description>Snoop mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>Stall</name>
                     <description>STALL handshake</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNAK</name>
                     <description>Clear NAK</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SNAK</name>
                     <description>Set NAK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SD0PID_SEVNFRM</name>
                     <description>Set DATA0 PID/Set even               frame</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SODDFRM</name>
                     <description>Set odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EPDIS</name>
                     <description>Endpoint disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPENA</name>
                     <description>Endpoint enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPTSIZ5</name>
               <displayName>OTG_HS_DOEPTSIZ5</displayName>
               <description>OTG_HS device endpoint-5 transfer size           register</description>
               <addressOffset>0x3B0</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPTSIZ6</name>
               <displayName>OTG_HS_DOEPTSIZ6</displayName>
               <description>OTG_HS device endpoint-6 transfer size           register</description>
               <addressOffset>0x3D0</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPTSIZ7</name>
               <displayName>OTG_HS_DOEPTSIZ7</displayName>
               <description>OTG_HS device endpoint-7 transfer size           register</description>
               <addressOffset>0x3F0</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>RXDPID_STUPCNT</name>
                     <description>Received data PID/SETUP packet               count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
