bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x8.svd
            <register>
               <name>DSI_CMCR</name>
               <displayName>DSI_CMCR</displayName>
               <description>DSI Host Command mode Configuration           Register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TEARE</name>
                     <description>Tearing Effect Acknowledge Request               Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARE</name>
                     <description>Acknowledge Request Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GSW0TX</name>
                     <description>Generic Short Write Zero parameters               Transmission</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GSW1TX</name>
                     <description>Generic Short Write One parameters               Transmission</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GSW2TX</name>
                     <description>Generic Short Write Two parameters               Transmission</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GSR0TX</name>
                     <description>Generic Short Read Zero parameters               Transmission</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GSR1TX</name>
                     <description>Generic Short Read One parameters               Transmission</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GSR2TX</name>
                     <description>Generic Short Read Two parameters               Transmission</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GLWTX</name>
                     <description>Generic Long Write               Transmission</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSW0TX</name>
                     <description>DCS Short Write Zero parameter               Transmission</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSW1TX</name>
                     <description>DCS Short Read One parameter               Transmission</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSR0TX</name>
                     <description>DCS Short Read Zero parameter               Transmission</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLWTX</name>
                     <description>DCS Long Write               Transmission</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MRDPS</name>
                     <description>Maximum Read Packet Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_GHCR</name>
               <displayName>DSI_GHCR</displayName>
               <description>DSI Host Generic Header Configuration           Register</description>
               <addressOffset>0x6C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DT</name>
                     <description>Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>VCID</name>
                     <description>Channel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>WCLSB</name>
                     <description>WordCount LSB</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>WCMSB</name>
                     <description>WordCount MSB</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_GPDR</name>
               <displayName>DSI_GPDR</displayName>
               <description>DSI Host Generic Payload Data           Register</description>
               <addressOffset>0x70</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA1</name>
                     <description>Payload Byte 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DATA2</name>
                     <description>Payload Byte 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DATA3</name>
                     <description>Payload Byte 3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DATA4</name>
                     <description>Payload Byte 4</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_GPSR</name>
               <displayName>DSI_GPSR</displayName>
               <description>DSI Host Generic Packet Status           Register</description>
               <addressOffset>0x74</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMDFE</name>
                     <description>Command FIFO Empty</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMDFF</name>
                     <description>Command FIFO Full</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWRFE</name>
                     <description>Payload Write FIFO Empty</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWRFF</name>
                     <description>Payload Write FIFO Full</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRDFE</name>
                     <description>Payload Read FIFO Empty</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRDFF</name>
                     <description>Payload Read FIFO Full</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB</name>
                     <description>Read Command Busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_TCCR0</name>
               <displayName>DSI_TCCR0</displayName>
               <description>DSI Host Timeout Counter Configuration           Register 0</description>
               <addressOffset>0x78</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPRX_TOCNT</name>
                     <description>Low-power Reception Timeout               Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>HSTX_TOCNT</name>
                     <description>High-Speed Transmission Timeout               Counter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_TCCR1</name>
               <displayName>DSI_TCCR1</displayName>
               <description>DSI Host Timeout Counter Configuration           Register 1</description>
               <addressOffset>0x7C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HSRD_TOCNT</name>
                     <description>High-Speed Read Timeout               Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_TCCR2</name>
               <displayName>DSI_TCCR2</displayName>
               <description>DSI Host Timeout Counter Configuration           Register 2</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPRD_TOCNT</name>
                     <description>Low-Power Read Timeout               Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_TCCR3</name>
               <displayName>DSI_TCCR3</displayName>
               <description>DSI Host Timeout Counter Configuration           Register 3</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HSWR_TOCNT</name>
                     <description>High-Speed Write Timeout               Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PM</name>
                     <description>Presp mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_TCCR4</name>
               <displayName>DSI_TCCR4</displayName>
               <description>DSI Host Timeout Counter Configuration           Register 4</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LSWR_TOCNT</name>
                     <description>Low-Power Write Timeout               Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_TCCR5</name>
               <displayName>DSI_TCCR5</displayName>
               <description>DSI Host Timeout Counter Configuration           Register 5</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BTA_TOCNT</name>
                     <description>Bus-Turn-Around Timeout               Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_CLCR</name>
               <displayName>DSI_CLCR</displayName>
               <description>DSI Host Clock Lane Configuration           Register</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DPCC</name>
                     <description>D-PHY Clock Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACR</name>
                     <description>Automatic Clock lane               Control</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_CLTCR</name>
               <displayName>DSI_CLTCR</displayName>
               <description>DSI Host Clock Lane Timer Configuration           Register</description>
               <addressOffset>0x98</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LP2HS_TIME</name>
                     <description>Low-Power to High-Speed               Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>HS2LP_TIME</name>
                     <description>High-Speed to Low-Power               Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_DLTCR</name>
               <displayName>DSI_DLTCR</displayName>
               <description>DSI Host Data Lane Timer Configuration           Register</description>
               <addressOffset>0x9C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MRD_TIME</name>
                     <description>Maximum Read Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
                  <field>
                     <name>LP2HS_TIME</name>
                     <description>Low-Power To High-Speed               Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>HS2LP_TIME</name>
                     <description>High-Speed To Low-Power               Time</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_PCTLR</name>
               <displayName>DSI_PCTLR</displayName>
               <description>DSI Host PHY Control Register</description>
               <addressOffset>0xA0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DEN</name>
                     <description>Digital Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CKE</name>
                     <description>Clock Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_PCONFR</name>
               <displayName>DSI_PCONFR</displayName>
               <description>DSI Host PHY Configuration           Register</description>
               <addressOffset>0xA4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NL</name>
                     <description>Number of Lanes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SW_TIME</name>
                     <description>Stop Wait Time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_PUCR</name>
               <displayName>DSI_PUCR</displayName>
               <description>DSI Host PHY ULPS Control           Register</description>
               <addressOffset>0xA8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>URCL</name>
                     <description>ULPS Request on Clock Lane</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UECL</name>
                     <description>ULPS Exit on Clock Lane</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>URDL</name>
                     <description>ULPS Request on Data Lane</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UEDL</name>
                     <description>ULPS Exit on Data Lane</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_PTTCR</name>
               <displayName>DSI_PTTCR</displayName>
               <description>DSI Host PHY TX Triggers Configuration           Register</description>
               <addressOffset>0xAC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TX_TRIG</name>
                     <description>Transmission Trigger</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
